tutorials_13/STR_bird/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh on;

snap            on;

addLayers       off;

geometry
{
/*
    tank
    {
        type triSurface;
        file "tank.obj";
        regions
        {
            outlet { name outlet; }
        }
    }
    */
    tank
    {
        type triSurface;
        file "vessel.obj";
        regions
        {
            vessel_top { name outlet; }
        }
    }

    rotatingZone
    {
        type triSurface;
        file "rotatingZone.obj";
    }

    stirrer
    {
        type triSurface;
        file "stirrer.obj";
    }

    shaft
    {
        type triSurface;
        file "shaft.obj";
    }

    sparger
    {
        type triSurface;
        file "sparger.obj";
        regions
        {
            inlet { name inlet; }
        }
    }
}

castellatedMeshControls
{
    features
    (
    );

    refinementSurfaces
    {
        tank
        {
            level (2 2);
            patchInfo
            {
                type wall;
                inGroups (externalWall);
            }

            regions
            {
                outlet
                {
                    level (0 0);
                    patchInfo { type patch; }
                }
            }
        }

        rotatingZone
        {
            level (2 2);
            faceZone rotatingZone;
            cellZone rotatingZone;
            mode inside;
        }

        stirrer
        {
            level (3 3);
            patchInfo { type wall; }
        }

        shaft
        {
            level (2 2);
            patchInfo { type wall; }
        }

        sparger
        {
            level (2 2);
            patchInfo { type wall; }

            regions
            {
                inlet
                {
                    level (1 1);
                    patchInfo { type patch; }
                }
            }
        }
    }

    // delete "-disabled" below to enable refinementRegions
    refinementRegions-disabled
    {
        <surface>
        {
            mode    inside;
            level   2;
        }
    }

    insidePoint (0 0 0);
    nCellsBetweenLevels 3;
}

snapControls
{
    explicitFeatureSnap    off;
    implicitFeatureSnap    on;
}

addLayersControls
{
    layers
    {
        "tank.*" { nSurfaceLayers 0; }
        "stirrer.*" { nSurfaceLayers 0; }
        "shaft.*" { nSurfaceLayers 0; }
    }

    relativeSizes       on; // off, usually with firstLayerThickness
    expansionRatio      1.2;
    finalLayerThickness 0.5;
    minThickness        0.001;
    firstLayerThickness-disabled 0;
    maxThicknessToMedialRatio-disabled 0.3;
}

// delete "-disabled" to output mesh data, e.g. for layers
writeFlags-disabled
(
    scalarLevels
    layerSets
    layerFields
);

mergeTolerance 1e-6;

// ************************************************************************* //
