tutorials_13/STR_bird/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;

    limited         cellLimited Gauss linear 1;
    grad(U)         $limited;
    grad(k)         $limited;
    grad(omega)     $limited;
}

divSchemes
{
    default                     none;

    div(phi,alpha)              Gauss vanLeer;
    div(alphaRhoPhi,U)          Gauss linearUpwind limited;
    div(phi,U)                  Gauss linearUpwind limited;

    div(alphaRhoPhi,K)          Gauss limitedLinear 1;

    div(alphaRhoPhi,(p|rho))    Gauss limitedLinear 1;

    turbulence                  Gauss limitedLinear 1;
    div(alphaRhoPhi,k)          $turbulence;
    div(alphaRhoPhi,omega)      $turbulence;

    "div\(alphaRhoPhi,(h|e)\)"  Gauss limitedLinear 1;
    "div\(alphaRhoPhi.*,Yi\)"   Gauss limitedLinear 1;
    "div\(alphaPhi.*,f.*\)"     Gauss limitedLinear 1;

    div((((alpha*rho)*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
