tutorials_13/STR_bird/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    bubbles
    {
        nCorr                1;
        tolerance            1e-4;
        scale                true;
        solveOnFinalIterOnly true;
        sourceUpdateInterval 1;
    }
    
    "alpha.*"
    {
        nCorrectors     3;
        nSubCycles      3;

        MULES
        {
            nIter           1;
            globalBounds    yes;
        }

        MULESCorr       yes;
        MULESCorrRelax  0.5;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-10;
        relTol          0;
        minIter         1;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        smoother        DIC;
        tolerance       1e-9;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol         0;
    }

    "pcorr.*"
    {
        $p_rghFinal;
        tolerance       0.001;
        relTol          0;

    }

    "(U|k|omega|Yi|e|T|f).*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0;
        minIter         1;
    }
}

PIMPLE
{
    nOuterCorrectors    1;
    nCorrectors         7;
    nNonOrthogonalCorrectors 0;

    correctPhi          yes;

    faceMomentum        no;
    VmDdtCorrection     yes;
    dragCorrection      yes;
}

relaxationFactors
{
    equations
    {
        ".*"    1;
        "f.*"   0.6;
    }
}

// ************************************************************************* //
