tutorials_13/STR_bird/Allrun
#!/bin/sh

# Run from this directory
cd "${0%/*}" || exit 1

# Source tutorial run functions
. "$WM_PROJECT_DIR/bin/tools/RunFunctions"

#./Allmesh

runParallel foamRun -fileHandler collated
runApplication -a reconstructPar -fileHandler collated


#------------------------------------------------------------------------------
